micropython/micropython/ports/psoc6/boards/CY8CPROTO-062-4343W/mpconfigboard.h
// Board and hardware specific configuration
#define MICROPY_HW_MCU_NAME                     "PSoC62"    
#define MICROPY_HW_BOARD_NAME                   "CY8CPROTO-062-4343W"

#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT     "CY8C-062-4343W"
